app/controllers/bookmarklets_controller.rb

  def show
    @bookmarklet = Bookmarklet.find(params[:id])
---
SELECT * FROM "bookmarklets" WHERE ("bookmarklets"."id" = 0)